tap "clojure/tools"
tap "cue-lang/tap"
tap "dagger/tap"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "railwaycat/emacsmacport"
tap "rigellute/tap"
tap "sniptt-official/tap"
tap "thoughtbot/formulae"
tap "zackelia/formulae"

brew "ack"
brew "aspell"
brew "automake"
brew "awscli"
brew "bandwhich"
brew "bat"
brew "boot-clj"
brew "broot"
brew "calcurse"
brew "chezmoi"
brew "chicken"
brew "choose-rust"
brew "clang-format"
brew "clisp"
brew "cmake"
brew "cmatrix"
brew "coreutils"
brew "cowsay"
brew "croc"
brew "cue-lang/tap/cue"
brew "curl"
brew "dagger"
brew "ddrescue"
brew "diff-so-fancy"
brew "direnv"
brew "dnsmasq", restart_service: true
brew "docker"
brew "dust"
brew "editorconfig"
brew "entr"
brew "exercism"
brew "fd"
brew "fennel"
brew "ffmpeg"
brew "figlet"
brew "fselect"
brew "fswatch"
brew "fx"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "git-flow"
brew "gitleaks"
brew "glow"
brew "gnupg"
brew "golangci-lint"
brew "graphviz"
brew "guile"
brew "hadolint"
brew "heroku/brew/heroku"
brew "hexyl"
brew "highlight"
brew "htmlq"
brew "htop"
brew "hunspell"
brew "imagemagick"
brew "isync"
brew "jmeter"
brew "jq"
brew "k6"
brew "k9s"
brew "kubernetes-cli"
brew "lazydocker"
brew "lf"
brew "libvterm"
brew "lux"
brew "m-cli"
brew "monolith"
brew "neovim"
brew "nmap"
brew "noti"
brew "openjdk"
brew "openssl@1.1"
brew "pandoc"
brew "pkg-config"
brew "procs"
brew "protobuf"
brew "qrencode"
brew "railwaycat/emacsmacport/emacs-mac"
brew "restic"
brew "ripgrep"
brew "rlwrap"
brew "sbcl"
brew "scrcpy"
brew "sd"
brew "shfmt"
brew "sniptt-official/tap/ots"
brew "telnet"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tmux-xpanes"
brew "tmuxinator"
brew "tokei"
brew "tree"
brew "tree-sitter"
brew "unbound"
brew "up"
brew "vegeta"
brew "viddy"
brew "vifm"
brew "vim"
brew "wakeonlan"
brew "watch"
brew "websocat"
brew "wget"
brew "xsv"
brew "youtube-dl"
brew "yq"
brew "z"
brew "zackelia/formulae/bclm"
brew "zeromq"
brew "zlib"
brew "zsh"
brew "zstd"

cask "alacritty"
cask "android-platform-tools"
cask "appcleaner"
cask "audacity"
cask "brave-browser"
cask "discord"
cask "docker"
cask "emacs"
cask "firefox"
cask "font-computer-modern"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fontawesome"
cask "font-inconsolata"
cask "font-iosevka"
cask "font-iosevka-aile"
cask "font-iosevka-etoile"
cask "font-iosevka-sparkle"
cask "font-iosevka-ss08"
cask "font-jetbrains-mono"
cask "font-material-icons"
cask "font-source-code-pro"
cask "gitkraken"
cask "google-chrome"
cask "idafree"
cask "imageoptim"
cask "java"
cask "keybase"
cask "keycastr"
cask "lens"
cask "logitech-options"
cask "lunar"
cask "mactex"
cask "monitorcontrol"
cask "monodraw"
cask "postman"
cask "robo-3t"
cask "sloth"
cask "soundsource"
cask "spotify"
cask "stats"
cask "tableplus"
cask "the-unarchiver"
cask "tor-browser"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "xbar"
cask "zenmap"
cask "zoom"
