tap "charmbracelet/tap"
tap "clojure/tools"
tap "d12frosted/emacs-plus"
tap "dagger/tap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "joaofnds/tap", "git@github.com:joaofnds/homebrew-tap"
tap "ynqa/tap"
tap "zackelia/formulae"

brew "age"
brew "archiver"
brew "aspell"
brew "ast-grep"
brew "automake"
brew "bat"
brew "broot"
brew "charmbracelet/tap/freeze"
brew "charmbracelet/tap/gum"
brew "chezmoi"
brew "chezscheme"
brew "chicken"
brew "choose-rust"
brew "clang-format"
brew "clisp"
brew "cmake"
brew "cmatrix"
brew "coreutils"
brew "croc"
brew "curl"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-native-comp"]
brew "dagger"
brew "dasel"
brew "delve"
brew "dsq"
brew "duckdb"
brew "dust"
brew "editorconfig"
brew "elixir"
brew "entr"
brew "erlang"
brew "exercism"
brew "fd"
brew "fennel"
brew "ffmpeg"
brew "figlet"
brew "flyctl"
brew "fnlfmt"
brew "fselect"
brew "fx"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "gitleaks"
brew "gitu"
brew "gleam"
brew "glow"
brew "gnupg"
brew "go-task"
brew "golangci-lint"
brew "graphviz"
brew "guile"
brew "hadolint"
brew "hexyl"
brew "highlight"
brew "htmlq"
brew "htop"
brew "hunspell"
brew "hyperfine"
brew "imagemagick"
brew "jless"
brew "joaofnds/tap/astro"
brew "jq"
brew "k6"
brew "k9s"
brew "kubernetes-cli"
brew "lazydocker"
brew "lima"
brew "lolcat"
brew "lua"
brew "m-cli"
brew "mage"
brew "mise"
brew "monolith"
brew "neovim"
brew "nmap"
brew "noti"
brew "pandoc"
brew "procs"
brew "protobuf"
brew "qrencode"
brew "rclone"
brew "redis"
brew "restic"
brew "ripgrep"
brew "sbcl"
brew "sd"
brew "shellcheck"
brew "shfmt"
brew "sqlfluff"
brew "sqlite"
brew "telnet"
brew "the_silver_searcher"
brew "tmux"
brew "tmux-xpanes"
brew "tmuxinator"
brew "tokei"
brew "tree"
brew "tree-sitter"
brew "ttyplot"
brew "typos-cli"
brew "up"
brew "vegeta"
brew "viddy"
brew "vifm"
brew "vim"
brew "wakeonlan"
brew "watch"
brew "websocat"
brew "wget"
brew "xsv"
brew "yazi"
brew "ynqa/tap/jnv"
brew "yq"
brew "yt-dlp"
brew "z"
brew "zackelia/formulae/bclm"
brew "zeromq"
brew "zsh"

cask "alacritty"
cask "android-platform-tools"
cask "appcleaner"
cask "audacity"
cask "brave-browser"
cask "discord"
cask "font-comic-mono"
cask "font-computer-modern"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fontawesome"
cask "font-inconsolata"
cask "font-iosevka-aile"
cask "font-iosevka-ss08"
cask "font-source-code-pro"
cask "gitkraken"
cask "google-chrome"
cask "imageoptim"
cask "keybase"
cask "keycastr"
cask "logi-options-plus"
cask "mongodb-compass"
cask "monitorcontrol"
cask "monodraw"
cask "ngrok"
cask "obs"
cask "obsidian"
cask "pop"
cask "postman"
cask "raycast"
cask "redisinsight"
cask "shottr"
cask "sloth"
cask "soundsource"
cask "spotify"
cask "stats"
cask "tableplus"
cask "the-unarchiver"
cask "tor-browser"
cask "transmission"
cask "tuple"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "xbar"
cask "zenmap"
cask "zoom"
