tap "clojure/tools"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "rigellute/tap"
tap "thoughtbot/formulae"
brew "ack"
brew "annie"
brew "aspell"
brew "openssl@1.1"
brew "automake"
brew "awscli"
brew "bandwhich"
brew "bat"
brew "broot"
brew "calcurse"
brew "chezmoi"
brew "clisp"
brew "cmake"
brew "cmatrix"
brew "coreutils"
brew "curl"
brew "ddrescue"
brew "diff-so-fancy"
brew "docker-compose", link: false
brew "docker-machine"
brew "dust"
brew "editorconfig"
brew "entr"
brew "exercism"
brew "fd"
brew "unbound"
brew "pkg-config"
brew "ffmpeg"
brew "figlet"
brew "fselect"
brew "fswatch"
brew "fx"
brew "fzf"
brew "git"
brew "git-delta"
brew "glow"
brew "gnupg"
brew "graphviz"
brew "hexyl"
brew "highlight"
brew "htop"
brew "hunspell"
brew "imagemagick"
brew "isync"
brew "jq"
brew "k9s"
brew "lazydocker"
brew "lf"
brew "libvterm"
brew "m-cli"
brew "monolith"
brew "neovim"
brew "nmap"
brew "noti"
brew "openjdk"
brew "pandoc"
brew "qrencode"
brew "ripgrep"
brew "rlwrap"
brew "sbcl"
brew "scrcpy"
brew "shfmt"
brew "telnet"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tmux-xpanes"
brew "tokei"
brew "tree"
brew "up"
brew "vifm"
brew "vim"
brew "wakeonlan"
brew "watch"
brew "wget"
brew "xsv"
brew "youtube-dl"
brew "yq"
brew "z"
brew "zsh"
brew "heroku/brew/heroku"
cask "aerial"
cask "alacritty"
cask "android-platform-tools"
cask "appcleaner"
cask "brave-browser"
cask "brooklyn"
cask "datagrip"
cask "docker"
cask "emacs"
cask "firefox"
cask "font-cascadia-pl"
cask "font-computer-modern"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fontawesome"
cask "font-inconsolata"
cask "font-iosevka"
cask "font-iosevka-aile"
cask "font-iosevka-etoile"
cask "font-iosevka-sparkle"
cask "font-iosevka-ss08"
cask "font-jetbrains-mono"
cask "font-material-icons"
cask "font-source-code-pro"
cask "gitkraken"
cask "google-chrome"
cask "intellij-idea"
cask "java"
cask "keybase"
cask "keycastr"
cask "logitech-options"
cask "lunar"
cask "mactex"
cask "monitorcontrol"
cask "obinslab-starter"
cask "obs"
cask "postman"
cask "robo-3t"
cask "sloth"
cask "spotify"
cask "stats"
cask "tableplus"
cask "the-unarchiver"
cask "tor-browser"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "zenmap"
